# [문제 1]
"""  
(학생명, 국어, 수학, 영어) 형태의 tuple 데이터 여러개가
튜플에 저장되어있다.
이러한 튜플을 zip()함수 사용하여
수학 성적만 추출한 뒤 수학 성적의 평균을 구하는 코드를 작성하세요
scores = (('김성한', 88, 95, 90), ('이영희', 85, 100, 76), ('최동길', 70, 80, 90), ('황순원', 100, 88, 77))
"""

# [문제 1]
scores = (('김성한', 88, 95, 90), ('이영희', 85, 100, 76), ('최동길', 70, 80, 90), ('황순원', 100, 88, 77))
student, kor, math, eng = zip(*scores)
total = sum(math)
print(total/len(math))

# [문제 2] 구구단 중 2, 3 단의 결과값을 담고 있는 리스트를 만들어서 출력하세요 (축약문 사용)
# [2, 4, 6, ....3, 6, 9....]

# [문제 2]
x = [2 * i for i in range(1, 10)]
y = [3 * i for i in range(1, 10)]
print(x + y)

# [문제 3] 다음 리스트에서 **문자열의 길이가 3이상인 단어만 대문자로 변환하여 새로운 리스트를 생성하시오.(축약문)
# hint) 문자열 upper(): 대문자로 변환/lower(): 소문자로 변환
# words = ["hi", "python", "sun", "go", "coffee", "cat"]

# [문제 3]
words = ["hi", "python", "sun", "go", "coffee", "cat"]


# [문제 4] 아래 리스트에서 문자열이면서 알파벳으로만 구성된 요소만
# 모두 소문자로 변환하여 새로운 리스트를 생성하시오. (리스트 컴프리헨션 활용)
# data = ["Hello", "WORLD", 123, "Python3", "AI", "deep"]

# [문자 4]

data = ["Hello", "WORLD", 123, "Python3", "AI", "deep"]
text = [i.lower() for i in data if i != 123]
print(text)